# BuiltInFailures.GlobalParameterFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GlobalParameterFailures Class
BuiltInFailures Class Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class GlobalParameterFailures
```

Visual Basic
---
```text
Public NotInheritable Class GlobalParameterFailures
```

Visual C++
---
```text
public ref class GlobalParameterFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..GlobalParameterFailures
# See Also
BuiltInFailures..::..GlobalParameterFailures Members
Autodesk.Revit.DB Namespace